<?php
class Quote extends CI_Controller
{
    public function __construct()
    {
        parent::__construct();
        if ($this->session->userdata('is_admin_login') != true) {
            redirect(ADMIN_URL . 'login');
            exit;
        }
        if ($this->session->userdata('role') != 0) {
            redirect(ADMIN_URL . 'dashboard');
        }
        $this->load->model('admin/mdl_quote');
    }

   /*  public function index()
    {
        $data['data'] = array('list' => $this->mdl_fonts->getFontList());
        $data['middle'] = 'admin/font/listfont';
        $this->load->view('admin/template', $data);
    } */

    public function addQuoteData()
    {
        $data = array(
            "0"=>"પાણી ની માટલી, દવા ની બાટલી, \n અને તૂટેલી ખાટલી, છેલ્લી સંપતિઆટલી, \n તો શા માટે હાય હાય આટલી..",
            "1"=>"વિચાર અને માન્યતાઓથી જ્યારે \n મન મુક્ત થાય પછી તે સક્રિય બને છે…",
            "2"=>"સંબંધો સુંદર રાખવા હોય તો ઉંડાણ,\n સુધી રાખો સાહેબ કેમ કે મોતી\n ક્યારેય કિનારા પર નથી હોતા!",
            "3"=>"દરેક દિવસ એક અપેક્ષા થી શરુ થાય છે,\n અને એક અનુભવ થી પૂરો થાય છે!",
            "4"=>"જે નિરાશા ને કદી જોતાં નથી,\n તે આશા કદી ખોતા નથી\n અને જે પ્રયત્નો પર જીવી જાણે છે\n તે કદી કિસ્મત પર રોતા નથી.",
            "5"=>"છોડી શકો તો પોતાના ઘમંડને છોડજો, \n સબંધોને છોડીને કોઈ \n આજ સુધી સુખી નથી થયું.",
            "6"=>"મહાન થવું એ તો સામાન્ય બાબત છે,\n પરંતુ સામાન્ય થઈને રહેવું \n એ ખરેખર મહાન વાત છે ",
            "7"=>"ગભરાયા વગર સંઘર્ષ કરતા \n રહો કેમકે સંઘર્ષ દરમિયાન જ \n માણસ એકલો હોય છે સફળતા \n મળ્યા પછી આખી દુનિયા \n તેની સાથે હોય છે...",
            "8"=>"People give up trying again due  to defeat they get in way of success, this is the biggest obstacle in the way of success.",
            "9"=>"Best way find yourself is to loose yourself in the service of others. - Mahatma Gandhi",
            "10"=>"Everything is easy when we are busy, nothing is easy when we are lazy.",
            "11"=>"When we achieve its a great joy but when we fail its a great lesson.",
            "12"=>"If you are searching for a person who fill change your life, take a look in the mirror.",
            "13"=>"Confidence doesnt come when you have all answers... But it comes when you are ready to face all questions.",
            "14"=>"Help people even when you know they cant help back",
            "15"=>"To success in life,you have a single minded devotion to your goal. - A.P.J abdul kalam",
            "16"=>"You dont have to be great to start, but you have to start to be great. Rise up & attack the day with enthusiasm.",
            "17"=>"A smile can change the world & make it more bright.",
            "18"=>"જો લોકો તમને નીચે પછાડવાણી \n કોશીસ કરે, તો તમે એ વાતનું ગર્વ \n જરૂર લેજો કે, તમે એ બધાની ઉપર છો!",
            "19"=>"પોતાની નિષ્ફળતા માટે બીજાને \n કારણભૂત માનવા કરતા, પોતાનામાં \n રહેલા દોષોને સુધારવામાં \n આવે એમાંજ શાણપણ છે.",
            "20"=>"પવિત્ર વિચારનું સદા મનન કરવું જોઈએ \n અને હલકા સંસ્કારોને દૂર કરવા મથવું જોઈએ…",
            "21"=>"જિંદગીમાં હંમેશા જીદ કરતા શીખો,\n જે નસીબમાં નથી લખ્યું એને પણ \n મહેનતથી મેળવતા શીખો.",
            "22"=>"આવતીકાલની પ્રગતિ અને સલામતિનો \n આધાર તમારી આજની પ્રવૃત્તિ પર છે.",
            "23"=>"દરેક ને જીવનમાં સફળતા એક દિવસ માં \n જ નથી મળી જતી પણ નક્કી કરી લો \n તો એક દિવસ જરૂર મળે છે.",
            "24"=>"કોઈ દિવસ નિર્ણય લીધા પછી ગભરાશો \n નહીં. જો નિર્ણય સાચો હશે, \n તો સફળતા મળશે... અને ખોટો હશે, \n તો કંઈક શીખવા મળશે.",
            "25"=>"તમારી કુશળતા પર દરેક વ્યક્તિ ત્યાં \n સુધી ભરોસો નહીં કરે જ્યાં સુધી તમે \n સફળ નહીં બનો. ",
            "26"=>"વ્યક્તિ ને સમજવા માટે દર વખતે \n ભાષાની જરૂરત નથી હોતી એનું \n વર્તન પણ, ઘણું બધું કહી દે છે.",
            "27"=>"માણસ એકલતા થી કંટાળીને સંબંધ \n બાંધે છે અને પછી સંબંધ થી \n કંટાળીને એકલતા માંગે છે..!",
            "28"=>"માણસ જીવનમા ગમે તેટલો વેપારી \n બની જાય પરંતુ પોતાની તકલીફ વેચી \n શક્તો નથી અને શાંતિ \n ખરીદી નથી શક્તો..!",
            "29"=>"ભૂલી જા તારા ભૂતકાળને એ તો માત્ર \n પવનની લહેર હતી સંભાળ તારા \n ભવિષ્યને તોફાન તો હજુ બાકી છે..",
            "30"=>"બે મત નથી એક જ મત છે કે આ \n સંસાર રમત છે જૂઠો જીતે અને સાચો \n હારે એવી બાજીનું નામ જગત છે..!",
            "31"=>"જિંદગી જેવી મળી છે તેવી માણી લ્યો, \n જિંદગી જીવવામાં મજા છે, \n ફરિયાદો કરવામાં નહીં.",
            "32"=>"નીતિ સાચી હશે તો નસીબ ક્યારે પણ \n ખરાબ નહીં થાય... બીજો માણસ \n આપણામાં વિશ્વાસ મૂકી શકે, \n એ જ જીવનની સૌથી મોટી સફળતા છે..!",
            "33"=>"શિક્ષણ તો શાળા કોલેજ \n માંથી મળે છે સાહેબ પણ સંસ્કાર \n તો પરિવાર માંથી જ આવે છે.",
            "34"=>"જીવન નો આનંદ માણવો હોય તો \n તમારા જીવનને બીજા ની સાથે સરખાવો \n નહીં, કેમ કે આજે માનવી પોતાના દુ=>ખ થી \n જેટલો દુઃખી નથી, તેના કરતાં \n વધારે બીજાના સુખથી દુઃખી થાય છે",
            "35"=>"માણસ બંને હાલતમાં મજબુર છે, \n દુઃખથી ભાગી નથી શકતો અને \n ખુશીને ખરીદી નથી શકતો.",
            "36"=>"કાયમ આનંદ માં રહેવા માટે, \n સુવિધાઓ ની નહીં પણ \n સમજણની જરૂર છે.…!",
            "37"=>"મન માં પવિત્રતા અને પાયા માં નીતી \n હશે તો. જીવન માં પરિક્ષા આવી શકે \n પરંતુ સમસ્યા તો નહીં જ આવે.",
            "38"=>"જેને વિવાદ કરવો છે, તેની પાસે પક્ષ છે, \n જેને વિકાસ કરવો છે, તેની પાસે પોતાનું લક્ષ્ય છે.",
            "39"=>"મહત્વનું એ નથી કે તમારી ઉંમર કેટલી છે, \n મહત્વનું છે કે તમે કઈ ઉંમર ના વિચાર રાખો છો.",
            "40"=>" સમય એટલો સરસ પસાર કરો કે યાદ કરો \n ત્યારે ખશી થાય અફસોસ નહીં!",
            "41"=>"માટી જો ચંમ્પલને ચોટીને આવે તો તે ઘરના ઉંમરા સુધી જ આવી શકે છે પણ જો એમાટલું બનીને \n આવે તો ઘરના પણિયારે પુજાય છે ઍમ વ્યક્તિનું નહીં પણ વ્યક્તિ નૌ  ઘડતર  નું મહત્વ છે...",
            "42"=>"તમારી કુશળતા પર દરેક વ્યક્તિ ત્યાં સુધી ભરોસો નહીં કરે જ્યાં સુધી તમે સફળ નહીં બનો",
            "43"=>"પહેલાં બે માણસ ઝગડતા ત્યારે ત્રીજો છોડાવવા આવતો આજકાલ જમાનો એવો આવ્યો કે ત્રીજો વિડીયો ઉતારવા માંડે છે... ! !",
            "44"=>"જે આનંદ આપણે મેળવીએ છીએ તેનો થાક લાગે છે, પરંતુ જે આનંદ આપણે બીજાને આપીએ છીએ તેનો થાક લાગતો નથી",
            "45"=>"વ્યક્તિ ને સમજવા માટે દર વખતે ભાષાની જરૂરત નથી હોતી એનું વર્તન પણ, – ઘણું બધું કહી દે છે... !!! ",
            "46"=>"કૌન કહેતા હૈ કી આદમી અપની કિસ્મત ખુદ લિખતા હૈ અગર યે સચ હૈ તો કિસ્મત મેં દર્દકૌન લિખતા હૈ... ?? ",
            "47"=>"લાખ રૂપિયા ની ઘડિયાળ ભલેને આપણા હાથમાં હોય પણ સમય તો પ્રભુ ના હાથમાં જ છે",
            "48"=>"ભૂખ લાગે ત્યારે ખાવું તે પ્રકૃતિ, પારકાનું પડાવીને ખાવું તે વિકૃતિ, ભૂખ્યા રહીને બીજાને ખવડાવવું તે સંસ્કૃતિ",
            "49"=>"હૃદય પર જો પ્રભુનું આસન હોય અને મન પર જ પ્રભુનું શાસન હોય તેનું જીવન હંમેશા વૃંદાવન હો",
            "50"=>"જીવનમાં તોફાન આવે તે પણ  જરૂરી છે, ખબર તો પડે, કોણ હાથ છોડાવીને ભાગે છે, ને કોણ હાથ પકડીને સાથે ચાલે",
            "51"=>"માણસ તો સિમ્પલ છે ખાલી માણસાઈ જ  કોમ્પ્લિકેટેડ  છે..!!!",
            "52"=>"બિના કિતાબો કે જો પઢાઇ શીખી જાતી હૈ. ઉસે  જિંદગી કહતે",
            "53"=>"બીજાની ભૂલ કાઢવા માટે ભેજું જોઈએ અને પોતાની ભૂલ સ્વીકારવા માટે કલેજું  જોઈએ સુખી થવા માટે ત્રણ વસ્તુ યાદ રાખવી રડવું નહી લડવું નહી, કોઈને નડવું નહી .",
            "54"=>"मनुष्य को हमेशा मौका नही ढूंढना चाहिये, \n क्योंकि जो आज है वही सबसे अच्छा मौका है।",
            "55"=>"प्रेम एक ऐसा अनुभव है जो मनुष्य को कभी हारने नही देता, \n और घृणा एक ऐसा अनुभव है जो इंसान को कभी जीतने नही देता।",
            "56"=>"मनुष्य को हमेशा यह नही सोचना चाहिए की वो अपने जीवन में कितना खुश है, \n बल्कि यह सोचना चाहिये की उस मनुष्य की वजह से दूसरे कितने खुश हैं।",
            "57"=>"जब तक हम किसी भी काम को करने की कोशिश नही करते हैं, जब तक हमे वो काम नामुमकिन ही लगता है।",
            "58"=>"मनुष्य को अपने लक्ष्य में कामयाब होने के लिए \n खुद पर विश्वास होना बहुत ज़रूरी है।",
            "59"=>"जब तक मनुष्य के जीवन में सुख-दुख नही आयेगा, \n तब तक मनुष्य को ये एहसास कैसे होगा कि जीवन में क्या सही है और क्या गलत।",
            "60"=>"हमेशा मनुष्य को परछाई और आईने की तरह दोस्त बनाने चाहिए, \n क्योंकि परछाई कभी साथ नही छोड़ती और आईना कभी झूठ नही बोलता।",
            "61"=>"अगर कोई मनुष्य आपको केवल ज़रूरत पड़ने पर ही याद करता है तो उस बात का बुरा मत मानो, क्योंकि जब अँधेरा हो जाता है तभी दिए की याद आती है।",
            "62"=>"धोखा उस फल का नाम होता है जो आसानी से किसी भी बाजार में मिल जाता है और बहुत खूबसूरत होता है।",
            "63"=>"जो व्यक्ति समझदार होता है वो खुद गलतियां नही करता है, \n बल्कि दुसरो की गलतियों से ही सब कुछ सिख लिया करता है।",
            "64"=>"लोग क्या कहेंगे, अगर ये सोचकर आप कुछ नही कर रहे तो आप जीवन की पहली परीक्षा में हार गये।",
            "65"=>"स्पष्ट बोलना पीठ पीछे बोलने से कई गुना बेहतर है।",
            "66"=>"अगर आप सफलता का आनंद उठाना चाहते हैं, तो अपने जीवन में कठिनाइयों का आगमन करवाइए।",
            "67"=>"जब अपने खफा होने लग जाएँ तो आप समझ लेना आप सही राह पर हैं।",
            "68"=>"सफलता ख़ुशी का कारण नही है, बल्कि ख़ुशी सफलता का कारण है।",
            "69"=>"हमें हमारा लक्ष्य प्राप्त करते वक्त सिर्फ 2 सोच रखनी चाहिए, अगर रास्ता मिल गया तो ठीक, नहीं तो रास्ता में खुद बना लूँगा।",
            "70"=>"जिन्दगी में कठिनाइयाँ हमें सही रास्ता दिखा जाती हैं।",
            "71"=>"हमें हमेशा बड़े सपने देखने चाहिए, क्योंकि अगर हम उनको देख सकते हैं, तो हम निश्चय ही उनको पूरा भी कर सकते हैं।",
            "72"=>"आप जिस भी स्तिथि में हैं, आप वहीं से लक्ष्य प्राप्त करने की कोशिश कीजिये, बजाए किसी के आगे हाथ फैलाने के।",
            "73"=>"वर्तमान को सबसे बेहतरीन पल बनाओ क्योंकि वो वापिस नही आता।",
            "74"=>"जिन्दगी एक खेल सी प्रतीत होती है, क्योंकि अगर आप इसमें भाग ले रहे हैं और आपको कायदे कानून नही पता तो आप निश्चय ही हारेंगे।",
            "75"=>"अगर आप जिन्दगी की दौड़ में धीरे चलते हुए भी कभी रुके नही हैं, तो यकीन मानिए आप सबसे तेज है।",
            "76"=>"हमेशा खुद से प्रश्न कीजिये, आखिर मै सबसे अलग क्यों हूँ? सफलता आपके कदम चूमेगी।",
            "77"=>"अगर आप को कोई काम करने में मजा नही आ रहा है, इसका मतलब है कि वो कार्य आपके करने लायक नही है।",
            "78"=>"अगर आप संतुष्ट नही हैं, तो आप सक्सेसफुल भी नही हैं।",
            "79"=>"हमेशा कामयाब व्यक्ति सही ढंग से अपने लक्ष्य तक पहुँचता है, चाहे उसके रास्ते में कितनी ही कठिनाइयाँ क्यों न आएं।",
            "80"=>"आप कभी भी कामयाब नही बन सकते अगर आप अपने अतीत को याद करके परेशान रहते हैं।",
            "81"=>"जिस दिन आप बुरे विचारों के ऊपर अच्छे विचारों को रख देंगे, जिन्दगी खुदबखुद और बेहतरीन हो जाएगी।",
            "82"=>"अक्सर मैंने उन लोगो को अकेला देखा है, जो दुसरों की फ़िक्र करते हैं।",
            "83"=>"ज्ञान की रौशनी हमें दूर तक ले जाती है।",
            "84"=>"सारी दुनिया कहती है \n हार मान लो लेकिन \n दिल धीरे से कहता है \n एक बार और कोशिश कर \n तूं जरूर कर सकता है!",
            "85"=>"ये दुनिया बहुत अजीब है, \n सच कहने पर रिश्ता तोड़ देती हैं! ",
            "86"=>"कोई कितना भी बोले अपने आप को शांत रखो, \n धूप कितनी भी तेज हो समंदर सुखा नहीं सकती ! ",
            "87"=>"किस्मत सिर्फ मेहनत से बदलती है, \n बैठ कर सोचते रहने से नही ||",
            "89"=>"अमूल्य होते हैं वो लोग, \n जो गुस्से में भी बात करने की, \n तमीज़ नहीं भूलते!!",
            "90"=>"ढलान पर तो पत्थर भी लुढ़क लेता है, \n शिखर पर जाने के लिए #साधना चाहिए…!",
            "91"=>"अपनी नजर में अच्छे रहो \n दुनिया का तो नजरिया ही अलग है…!",
            "92"=>"लोग कहते है दोस्ती बर्बाद करती है \n निभाने वाले मिल जाए तो दुनिया याद करती है! ",
            "93"=>"आज बुरा है कल अच्छा भी तो आएगा, \n वक़्त ही तो है रुक थोड़ी जाएगा…! ",
            "94"=>"अपना विश्वास और उम्मीद जिन्दा रखिये, \n इससे आपके डर लुप्त हो जायेंगे…!",
            "95"=>"किसी का साथ अगर तुम ज़िन्दगी भर चाहते हो \n तो उसे ये मत बताओ कि उसे कितना चाहते हो",
            "96"=>"तबियत पूछने वाला इंसान ढूंढो, \n वसीयत और हैसियत पूछने वाले तो बहुत मिल जाएंगे…!",
            "97"=>"तमाशा कोई और नहीं बल्कि हम \n ख़ुद बनाते हैं,अपनी जिंदगी का, \n हर किसी को अपनी कमजोरी बता कर…",
            "98"=>"जो गिरकर संभल जाता है, \n वो अक्सर जिंदगी को समझ जाता है…",
            "99"=>"हारना तब जरूरी हो जाता है, \n जब लड़ाई अपनों से हो..",
            "100"=>"किसी के लिए इतना मत गिरो \n कि वो तुम्हे कुचल के निकल जाएं",
            "101"=>"अगर, मगर और  काश  में हूं \n मैं खुद अपनी तलाश में हूं।",
            "102"=>"वक़्त जब आंखें फेर लेता हैं.. \n तो शेर को भी कुत्ता घेर लेता है..",
            "103"=>"लोगो की कमजोरियों का पता लगाने से अच्छा है, \n मनुष्य अपने दुर्गुणों और कमजोरियों का पता लगाए !!",
            "104"=>"सफलता की ख़ुशी मनाना अच्छा है पर, \n उससे जरुरी है अपनी असफलता से सीख लेना !!",
            "105"=>"बिता हुआ कल अगर वर्तमान पर नकारात्मक प्रभाव डालने लगे, \n तो बीते हुए कल को झहर समझकर त्याग देना चाहिए !!",
            "106"=>"किसी को प्रेम देना सबसे बड़ा उपहार है, \n और किसीका प्रेम पाना सबसे बड़ा सम्मान है !!",
            "107"=>"जिस व्यक्ति ने कभी गलती नहीं की, \n उसने कभी नया करने की कोशिश नहीं की !!",
            "108"=>"हारना तब आवश्यक हो जाता है जब लड़ाई अपनों से हो, \n और जितना तब आवश्यक हो जाता है जब लड़ाई अपने आप से हो !!",
            "109"=>"जिसमे धीरज है और जो महेनत से नहीं घबराता,कामयाबी उसकी दासी है !!",
            "110"=>"सफलता मन की शीतलता से उत्पन्न होती है, \n ठंडा लोहा ही गर्म लोहे को काट व मोड़ सकता है !!",
            "111"=>"किसी को कभी दुःख मत देना क्यूंकि, \n दी हुई चीज एक दिन हजार गुनी होकर लौटती है !!",
            "112"=>"यूँ तो पत्थर की भी तक़दीर बदल सकती है, \n शर्त ये है की उसे दिल से तराशा जाए !!",
            "113"=>"घमंड…बहुत भूखा होता है…",
        );
        $i=0;        
        foreach($data as $val){
            $res = $this->mdl_quote->checkQuoteExist($val);
            $input = array(
                "title" => $val,
                "status" => 1,
            );
            if($res <= 0){
                $this->mdl_quote->addQuotes($input);
                $i++;
            }
        }
        echo "Total insert record ",$i;
    }
}
